const adjectives = [
  "빠른", "귀여운", "멋진", "신속한", "기발한", "지적인", "용감한", "침착한", "차가운", "온화한",
  "앞구르기하는", "밥먹는", "날렵한", "고요한", "튼튼한", "힘센", "상냥한", "낭만적인", "배고픈", "졸린",
  "행복한", "재빠른", "둔한", "화난", "당당한", "우아한", "활발한", "장난꾸러기", "귀차니즘한", "도도한",
  "반짝이는", "이상한", "엉뚱한", "부끄러운", "말없는", "활기찬", "잠꾸러기", "꿈꾸는", "미소짓는", "냉정한",
  "차분한", "노래하는", "춤추는", "무서운", "강력한", "어리둥절한", "웃긴", "온순한", "달리는", "느긋한",
  "쓸쓸한", "외로운", "신비로운", "자신감있는"
];

const animals = [
  "토끼", "고양이", "늑대", "호랑이", "코끼리", "쿼카", "사슴", "여우", "부엉이", "거북이",
  "곰", "삼치", "시츄", "허스키", "사자", "판다", "알파카", "햄스터", "너구리", "까마귀",
  "고슴도치", "라쿤", "다람쥐", "수달", "청설모", "앵무새", "카멜레온", "펭귄", "백곰", "미어캣",
  "오소리", "문어", "오징어", "고래", "돌고래", "독수리", "올빼미", "치타", "재규어", "표범",
  "하이에나", "비버", "여우원숭이", "카피바라", "수리부엉이", "두더지", "고라니", "염소", "물개", "바다사자",
  "청둥오리", "까치", "두루미", "이구아나", "맹꽁이", "두꺼비", "산양", "북극여우", "도롱뇽",
  "악어", "코뿔소", "퓨마", "개미핥기", "낙타", "얼룩말", "멧돼지", "사막여우", "수탉", "고니",
  "원앙", "참새", "비둘기", "갈매기", "벌새", "살모사", "왕뱀", "박쥐", "메추라기", "담비"
];


// ✅ 랜덤 닉네임 생성 함수
export function generateRandomNickname() {
  const adj = adjectives[Math.floor(Math.random() * adjectives.length)];
  const animal = animals[Math.floor(Math.random() * animals.length)];
  return `${adj} ${animal}`;
}
